{
	"notFound": {
		"message": "Страница не найдена"
	},
	"general": {
		"caseSensitive": "с учетом регистра",
		"password": "пароль"
	},
	"downloads": {
		"android": [
			"Доступны *.apk файлы.",
			"Google Play версия планируется к концу лета."
		],
		"ios": [
			"Вы можете самостоятельно собрать *.ipa из исходного кода (если у вас есть ADP аккаунт).",
			"Версия App Store планируется осенью."
		],
		"chrome": [
			"Вы можете самостоятельно установить расширение, загрузив распакованное в режиме разработчика.",
			"Версия для интернет-магазина Chrome планируется к концу лета."
		],
		"safari": [
			"В разработке",
			"Конец лета."
		],
		"windows": [
			"В разработке.",
			"Осень."
		],
		"linux": [
			"В разработке.",
			"Осень."
		],
		"macintosh": [
			"В разработке.",
			"Конец лета."
		]
	},
	"navigation": {
		"qa": "faq",
		"generate": "pro",
		"random": "lite",
		"download": "скачать",
		"about": "о проекте",
		"title": "getpass!"
	},
	"random": {
		"mainButton": {
			"validInput": "Сгенерировать пароль",
			"wrongAlphabet": "Алфавит не может быть пустым!"
		},
		"settings": {
			"number": "Цифры (0-9)",
			"upper": "Верхний регистр (A-Z)",
			"lower": "Нижний регистр (a-z)",
			"special": "Символы (!#$%&()*+,-.:;<=>?@[]^_{})",
			"length": "Длина пароля"
		},
		"alphabet": {
			"label": "алфавит",
			"custom": "Свой алфавит"
		}
	},
	"generate": {
		"input": {
			"login": "Логин",
			"website": "Вебсайт",
			"secret": "Секретное слово"
		},
		"settings": {
			"number": "Цифры (0-9)",
			"upper": "Верхний регистр (A-Z)",
			"lower": "Нижний регистр (a-z)",
			"special": "Символы (!#$%&()*+,-.:;<=>?@[]^_{})",
			"length": "Длина пароля",
			"counter": "Счетчик",
			"scrypt": {
				"warning": "**Внимание**: Вы должны быть уверены во вносимых изменениях. Этот параметр напрямую влияет на время генерирования паролей, а также на итоговый результат. Более того, в дополнение к секретному слову, вы должны будете запомнить настройку данных параметров, чтобы получить одинаковый пароль на разных устройствах. Вы всегда можете откатиться к стандартным настройкам.",
				"cost": "Параметр сложности",
				"blockSize": "Размер блока"
			}
		},
		"mainButton": {
			"validInput": "Getpass!",
			"loginMissing": "Пожалуйста, введите свой логин",
			"websiteMissing": "Пожалуйста, введите вебсайт",
			"secretMissing": "Пожалуйста, введите секретное слово",
			"wrongAlphabet": "Алфавит не может быть пустым!"
		}
	},
	"notify": {
		"passwordIsGenerated": "Пароль был сгенерирован и скопирован в буфер обмена",
		"incompatibleParams": "Несовместимые параметры ядра",
		"pwa": {
			"ready": "Контент закэширован для оффлайн использования [PWA готово].",
			"update": "Доступен новый контент, пожалуйста, обновите страницу."
		},
		"copied": "Текст скопирован в буфер обмена"
	},
	"meta": {
		"title": {
			"random": "Getpass Lite - Random Password Generator",
			"generate": "Getpass Pro -  Best Free Alternative To Password Managers",
			"qa": "Getpass FAQ - What You Need To Know",
			"downloads": "Getpass - Free Download",
			"notFound": ""
		},
		"description": {
			"random": "Getpass Lite is a flexible password generator. Up to 4096 symbols. Don't forget to check our Getpass Pro tool for a free alternative to cloud-based passwords managers.",
			"generate": "Getpass Pro is a stateless cross-platform password manager (generator). This tool allows users to generate cryptographically strong passwords based on their input data.",
			"qa": "Here you can find answers to most frequent questions about Getpass. Please, ask your question if you didn't find it in the list.",
			"downloads": "Download Getpass for: Mobile (iOS, Android), Browser (Chrome, Safari), Desktop (Mac, Win, Linux). Satisfaction guaranteed.",
			"notFound": ""
		}
	},
	"qa": {
		"q0": "Что такое Getpass?",
		"a0": [
			"Getpass это кроссплатформенный менеджер паролей (генератор).",
			"Данная программа позволяет генерировать криптографически сложные пароли на основе вводных данных.",
			"",
			"Getpass использует хэшобразную функцию формирования ключа (scrypt), которая выдает одинаковый пароль для одинаковых входных значений (которые включают в себя: Логин, Вебсайт и Кодовое слово).",
			"Эта функция не может быть обращена для получения входных значений, имея сгенерированный пароль.",
			"Для продвинутых пользователей: откройте настройки для доступа к дополнительным функциям."
		],
		"q1": "Как работает Getpass?",
		"a1": [
			"На основе пользовательских данных и дополнительных настроек функция scrypt генерирует криптографически сложные пароли.",
			"",
			"Пример:",
			"* Логин: **andromeda**  ",
			"* Вебсайт: **milkyway.com**  ",
			"* Секретное слово: **2,52m light years away** ",
			"",
			"Выдает пароль: **3q_q(MFWaMGeao+[CX**"
		],
		"q2": "Параметры генерации",
		"a2": [
			"В большинстве случаев вам не следует изменять данные параметры и можно воспользоваться стандартными настройками. (Вы можете узнать больше о данных настройках в соответствующем пункте FAQ)",
			"* Алфавит для генерации: цифры, A-Z, a-z, символы",
			"* Длина пароля: 18",
			"* Счетчик: 0",
			"* Параметры scrypt: N: 4096, r: 4, p: 1",
			"",
			"На заметку: для удобного кроссплатформенного использования вы можете экспортировать/импортировать настройки генерации, а также логины и вебсайты, с другого устройства с приложением Getpass."
		],
		"q3": "Что такое Логин?",
		"a3": [
			"Логин - это идентификатор аккаунта пользователя на конкретном вебсайте.",
			"Это может быть реальный логин пользователя для вебсайта, мобильный телефон или что-либо угодно.",
			"",
			"Для большинства случаев мы рекомендуем использовать реальные логины, так как Getpass был разработан с учетом того, чтобы генерировать безопасные пароли даже если Логин и Вебсайт являются публичной информацией.",
			"Обратите внимание: “andromeda” и “Andromeda” это два разных Логина (поле Логин учитывает регистр)"
		],
		"q4": "Что такое Вебсайт?",
		"a4": [
			"Вебсайт это название/адрес вебсайта/сервиса, для которого пользователь хочет сгенерировать пароль.",
			"Это может быть реальный адрес (например, milkyway.com).",
			"",
			"Для большинства случаев мы рекомендуем пользователям использовать реальные имена/адреса вебсайтов, по тем же причинам, что указаны в секции про Логин выше.",
			"Обратите внимание: “milkyway.com”, “milkyway”, “milkyway com” являются разными Вебсайтами."
		],
		"q5": "Что такое Секретное слово?",
		"a5": [
			"Секретное слово это набор символов, которое мы используем для генерации криптографически сложных паролей. Можете представить его как мастер-пароль, который вы используете для генерации остальных нужных вам паролей. Это может быть (на самом деле мы настаиваем на этом) любая комбинация комбинация букв, цифр и символов.",
			"",
			"Обратите внимание: не существует возможности получить Секретное слово, имея Логин, Вебсайт и сгенерированный пароль. Это наиболее важная информация и вы должны безопасно его хранить."
		],
		"q6": "Какие настройки входят в список расширенных настроек?",
		"a6": [
			"* Длина пароля и используемый алфавит. Привязываются к вебсайту. Иногда существуют дополнительные требования к паролям у определенных сервисов. Мы даем возможность пользователям изменять стандартные настройки генерации и (только на локальных версиях Getpass) мы сохраняем эти данные локально, чтобы исключить необходимость повторного ввода этих настроек и их запоминание.",
			"* Счетчик. Привязывается к вебсайту. Некоторые сервисы требуют регулярной смены пароля. Как отмечено выше, в Getpass одинаковые данные на входе приводят к одинаковым паролям на выходе. Для этого мы имплементировали переменную Счетчик. Увеличьте Счетчик, когда Вы хотите сгенерировать новый пароль для вебсайта, при этом не меняя Логин, Вебсайт и Секретное слово. Данные счетчика хранятся локально на вашем устройстве, как и настройки выше.",
			"* Параметры scrypt. Привязывается ко всему приложению (влияет на все). Вы должны понимать, что вы делаете, меняя данные настройки. Изменения настроек scrypt не только увеличивает или уменьшает сложность, но и напрямую влияет на время генерирования паролей. Вы также должны помнить, что мобильным устройствам требуется больше времени для сложных вычислений.",
			"Вы можете прочитать больше о параметрах scrypt на [wikipedia](https://ru.wikipedia.org/wiki/Scrypt).",
			"",
			"Обратите внимание: все данные настройки могут быть экспортированы и импортированы (вместе с Логинами и Вебсайтами), когда вы захотите перенести свои данные из одного устройства в другое. Нет необходимости вводить их повторно."
		],
		"q7": "Для чего присутствует изображение, которое меняется, когда я ввожу Секретное слово?",
		"a7": [
			"Заметили ли вы, что по умолчанию Секретное слово скрыто? Если да, то эта картинка является визуальным хэшем вашего Секретного слова, сделанная с помощью jdenticon. Она может быть полезна для того, чтобы понять, что вы корректно ввели секретное слово, без открытия видимости строки Секретное слово."
		],
		"q8": "Заметка о безопасности",
		"a8": [
			"Во-первых, Getpass (любая платформа или иплементация) не использует НИКАКИЕ ваши данные. Никакие POST запросы к серверам не совершаются. Вам не требуется подключение к Интернету для использования Getpass. Все вычисления производятся на вашем устройстве, будь то компьютер, мобильный телефон или веб-браузер (верно как для расширений, так и для вебсайта getpass.io). Исходный код приложения для всех платформ доступен на Github (ссылка находится в разделе Скачать).",
			"",
			"Во-вторых, есть небольшая разница между тем, как локальная версия (мобильное приложение, десктоп и расширение для браузера) и сервис версия (вебсайт getpass.io) используют ваши данные:",
			"* Сервис версия не хранит никакие данные, но в тоже время лишена некоторых функций локальных версий. Основной юзкейс: одноразовая генерация пароля или когда у вас нет возможности воспользоваться вашей локальной версией.",
			"* Локальная версия локально хранит список Логинов и Вебсайтов, а также все настройки генерации. Мы настаиваем на том что Логин и Вебсайт не являются конфиденциальной информацией и могут быть легко найдены в Интернете (в большинстве случаев номер телефона или почтовый адрес используется как Логин, но вы можете использовать то, что вы хотите для данного поля в Getpass). Мы храним эти данные, чтобы увеличить удобство пользователей при взаимодействии с программой - всего 4 нажатия для выбора Логина и Вебсайта. Данное удобство не уменьшает безопасность пользователей, так как мы даем им возможность скрывать эти данные внутри приложения или допускаем возможность использования пользовательских придуманных названий вместо реальных (например, вы можете использовать “git repos” вместо “github” или “google mail” вместо ”gmail”)",
			"",
			"Секретное слово НИКОГДА нигде не хранится. Это ключевые конфиденциальные данные и вы должны позаботиться об отвественном их хранении.",
			"",
			"Обратите внимание, что все поля ввода учитывают регистр! Изменение одного из символов в Логине, Вебсайте или Секретном слове повлечет к сильному изменению генерируемого пароля."
		],
		"q9": "Общие рекомендации по безопасности",
		"a9": [
			"С точки зрения безопасности данных существуют более и менее важные сервисы. Никто не запрещает вам использовать разные Секретные слова для разных Вебсайтов (но вы должны самостоятельно помнить какое слово для какого Вебсайта вы используете).",
			"",
			"Например, для не особо важного сервиса, вы можете использовать простое Секретное слово, например: “.NETdev2019”, но для других, например вашего банковского аккаунта, вы можете использовать что-то более сложное, например: “WhatAGre@t8267TimeToBeA%Developer%!”"
		],
		"q10": "В чем преимущества и недостатки использования Getpass?",
		"a10": [
			"Преимущества:",
			"* Приложение генерирует уникальные критографически сложные пароли для каждого аккаунта, который вы хотели бы защитить",
			"* Вы не должны ничего запоминать, кроме Секретного слова",
			"* Getpass доступен 24/7 с любого устройства по адресу getpass.io",
			"* Никакие ваши данные не покидают ваше устройство. Ваше Секретное слово не хранится (даже локально)",
			"* Вам не нужно доверять чей-либо частной программе для защиты ваших критических данных (вы можете изучить наш исходный код, а также помочь сделать Getpass лучше)",
			"",
			"Недостатки:",
			"* Вам потребуется некоторое время для замены старых паролей, на пароли генерируемые Getpass",
			"* В случае навязывания определенной политики регулярной смены паролей, мы не можем признать Счетчик элегантным решением данной проблемы, но мы считаем, что это наиболее удобный способ реализовать данную возможность."
		],
		"q11": "Что если мой пароль для определенного сайта был взломан?",
		"a11": [
			"В данном случае вы можете использовать параметр Счетчик, увеличив его значение с “0” по умолчанию. Обратите внимание, что взломанный пароль (даже если злоумышленник знает, что вы используете Getpass, а также используемые вами значения Логина и Вебсайта) не означает, что ваше Секретное слово было взломано. Получить Секретное Слово методом брутфорс на основе Логина,  Вебсайта и сгенерированного пароля не представляется практически возможным. ",
			"",
			"Другой способ решения данной проблемы (он не слишком элегантен, однако имеет место быть)является корректировка/изменения значения Вебсайт, используемого в Getpass. Например, вы можете использовать 'gmail_new', 'gmail_after-hacked', 'gmail.com', если изначальное вашим Вебсайтом было 'gmail'."
		]
	}
}
